* Keyboard codes
  Measured using ZOLID flexable keyboard via xev:
  | key          | code |
  |--------------+------|
  | play/pause   |  172 |
  | stop         |  174 |
  | raise volume |  123 |
  | lower volume |  122 |
  | audio prev   |  173 |
  | audio next   |  171 |

  These keys worked without any system modifications in android.

  Keys from the USB HID Usage Tables, chapter 10
  | key         | code |
  |-------------+------|
  | volume up   |  128 |
  | volume down |  129 |
  and the rest is missing.

  Going to snoop the usb bus for keycodes. Need to say that the device will
  transmit multimedia keys using the usb descriptor. How this works is
  documented in https://github.com/ddrown/teensy_usb_android


* Interface to SSOP-18
** TC2030-STK
   Microchip cables that translate to small footprint pads on a pcb.

* Measurements of coat
  Setup:
  - 2.5mm female trs
    T = yellow
    R = red
    S = blue
  - 2.5mm male trs
    T = yellow
    R = white
    S = blue
** Resistance
   Connect F 2.5mmTRS to male 2.5mm of coat
   resistance between yellow/tip and blue/ground:
   | key | resistance, Ohm |
   |-----+-----------------|
   | +   | 5.575 k         |
   | >1  | 31.67 k         |
   | 11< | 46.28 k         |
   | 1<  | 19.96 k         |
   | -   | 10.018 k        |
** Current
   Connect F 2.5mm TRS to male 2.5mm of coat
   Connect F TRS to M TRS with fluke 8600A (uA) between yellow lines
   Connect M TRS to coat widget
   Connect coat widget to phone
   | key | current in uA |
   |-----+---------------|
   | +   | 106           |
   | >1  | 55.1          |
   | 11< | 43.21         |
   | 1<  | 70.12         |
   | -   | 91.39         |
** Voltage
   using scope: voltage between yellow/tip and blue/sleeve was 3V but fluctuated +-200mV

* Calculations
  Determine the adc register value at a $Vcc, an $bits bit ADC, into an $rbits
  bit ADC register. The ADC is connected between the fibretronic buttons and a
  $Rl that tied to the Vcc supply.

  With Vcc at 5V, and a 25k resistor to each rail with the coat keys inbetween:
  | ! | Key     |       Rk |  Vadc |     Adc | Register |
  |---+---------+----------+-------+---------+----------|
  | # | none    |        0 | 5.000 |    1024 |      256 |
  | # | minus   |    10000 | 3.438 |     704 |      176 |
  | # | rev     |    20000 | 2.619 |     536 |      134 |
  | # | play    |    46200 | 1.613 |     330 |       82 |
  | # | forward |    31600 | 2.052 |     420 |      105 |
  | # | plus    |     5600 | 3.986 |     816 |      204 |
  |---+---------+----------+-------+---------+----------|
  | $ |         | Rl=22000 | Vcc=5 | bits=10 |  rbits=8 |
  #+TBLFM: $4=$Vcc-($Rk/($Rl+$Rk))*$Vcc;%.3f::$5=$Vadc/($Vcc/2^$bits);%.0f::$6=$Adc/(2^($bits-$rbits));%.0f
